"""риниваса Рамануджан – индийский математик, славившийся своей интуицией в области чисел.
Когда английский математик Годфри Харди навестил его однажды в больнице, он обмолвился,
что номером такси, на котором он приехал, было 1729, такое скучное и заурядное число.
На что Рамануджан ответил: "Нет, нет! Это очень интересное число. Это наименьшее число, выражаемое как сумма двух кубов двумя разными способами".
Напишите программу, которая находит аналогичные интересные числа. В ответе запишите первые 5 чисел в порядке возрастания, включая число 1729.

Примечание. Используйте вложенный цикл."""

counter = 0
limit = 3
flag = False
prev_num = 0
while counter < 5:
    limit += 1
    for i in range(1, limit + 1):
        for j in range(i + 1, limit):
            for k in range(i + 1, j):
                for l in range(i + 1, k):
                    if i ** 3 + j ** 3 == k ** 3 + l ** 3:
                        summ = i ** 3 + j ** 3
                        if summ > prev_num:
                            prev_num = summ
                            print(summ, i, j, k, l)
                            counter += 1
                            if counter == 5:
                                flag = True
                                break
