import random
"""Описание проекта: магический шар 8 (шар судьбы) — шуточный способ предсказывать будущее. 
Программа должна просить пользователя задать некий вопрос, чтобы случайным образом на него ответить."""

def asking_ball(question):
    responses = ['Даже не думай', 
                 'Мой ответ - нет', 
                 'По моим данным - нет', 
                 'Перспективы не очень хорошие', 
                 'Весьма сомнительно', 
                 'Пока неясно, попробуй снова', 
                 'Спроси позже', 
                 'Лучше не рассказывать', 
                 'Сейчас нельзя предсказать', 
                 'Сконцентрируйся и спроси опять', 
                 'Мне кажется - да', 
                 'Вероятнее всего', 
                 'Хорошие перспективы', 
                 'Знаки говорят - да', 
                 'Да', 
                 'Можешь быть уверен в этом', 
                 'Определённо да', 
                 'Никаких сомнений', 
                 'Предрешено', 
                 'Бесспорно']
    
    random.seed(question) # Один и тот же ответ на тот же вопрос
    rnd = random.randint(0, 19)
    message = responses[rnd]
    
    return message

def main():
    question = input('Задайте ваш вопрос: ')
    answer = asking_ball(question)
    print('Шар отвечает вам - {0}'.format(answer))

main()